burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_tzpcu.c
        if(QSPI_FLASH_MEM == p_non_secure_mark->memory_type){
            /* set TZSPC_TZMMPC0_NSMR0 address to reg_address */
            reg_address = (uint32_t)(&TZPCU_TZSPC_TZMMPC0_NSM0);
        }else if(SQPI_PSRAM_MEM == p_non_secure_mark->memory_type){
            /* set TZSPC_TZMMPC1_NSMR0 address to reg_address */
            reg_address = (uint32_t)(&TZPCU_TZSPC_TZMMPC1_NSM0);
        }

        if((p_non_secure_mark->start_address + p_non_secure_mark->length) > EXT_MEM_SIZE){
            ret = ERROR;
        }

        reg_value = ((p_non_secure_mark->start_address / EXT_MEM_GRANULARITY) << START_ADDRESS_POS) & START_ADDRESS_MASK;
        reg_value |= ((p_non_secure_mark->length / EXT_MEM_GRANULARITY) << LENGTH_POS) & LENGTH_MASK;
        
        REG32(reg_address + ((p_non_secure_mark->region_number) << 2U)) = reg_value;

        ret = SUCCESS;
    }
    return ret;
}

/*!
    \brief      lock TZSPC items (API_ID(0x0005U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void tzpcu_tzspc_items_lock(void)
{
    uint32_t reg_value;

    /* get TZSPC control register value */
    reg_value = TZPCU_TZSPC_CTL;
    reg_value |= TZPCU_TZSPC_CTL_LK;

    /* set TZSPC control register value */
    TZPCU_TZSPC_CTL = reg_value;
}

/*!
    \brief      configure debug type (API_ID(0x0006U))
    \param[in]  dbg_type: debug type
                only one parameter can be selected which is shown as below:
      \arg        INVASIVE_DEBUG: invasive debug
      \arg        NON_INVASIVE_DEBUG: non-invasive debug
      \arg        SECURE_INVASIVE_DEBUG: secure invasive debug
      \arg        SECURE_NON_INVASIVE_DEBUG: secure non-Invasive debug
    \param[in]  config_value: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void tzpcu_tzspc_dbg_config(uint32_t dbg_type, ControlStatus config_value)
{
    uint32_t reg_value;

    /* get TZSPC debug configuration register */
    reg_value = TZPCU_TZSPC_DBG_CFG;
    if(ENABLE == config_value){
        reg_value |= dbg_type;
    }else{
        reg_value &= ~dbg_type;
    }

    /* set TZSPC debug configuration register */
    TZPCU_TZSPC_DBG_CFG = reg_value;
}

#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */

/*!
    \brief      lock the control register of the TZBMPC sub-block (API_ID(0x0007U))
    \param[in]  tzbmpx: TZBMPCx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void tzpcu_tzbmpc_lock(uint32_t tzbmpx)
{
    uint32_t reg_value;

    /* get TZSPC TZBMPC_CTL configuration register */
    reg_value = TZPCU_TZBMPC_CTL(tzbmpx);
    reg_value |= TZPCU_TZBMPC_CTL_LK;

    /* set TZSPC TZBMPC_CTL configuration register */
    TZPCU_TZBMPC_CTL(tzbmpx) = reg_value;
}

/*!
    \brief      configure default security state (API_ID(0x0008U))
    \param[in]  tzbmpx: TZBMPCx(x=0,1,2,3)
    \param[in]  sec_state: security state
                only one parameter can be selected which is shown as below:
      \arg        DEFAULT_STATE: default state
      \arg        INVERT_STATE: invert the state
    \param[out] none
    \retval     none
*/
void tzpcu_tzbmpc_security_state_config(uint32_t tzbmpx, uint32_t sec_state)
{
    uint32_t reg_value;

    /* get TZSPC TZBMPC_CTL configuration register */
    reg_value = TZPCU_TZBMPC_CTL(tzbmpx);
    
    if(DEFAULT_STATE == sec_state){
        reg_value &= ~TZPCU_TZBMPC_CTL_SECSTATCFG;
    }else{
      if(INVERT_STATE == sec_state){
        reg_value |= TZPCU_TZBMPC_CTL_SECSTATCFG;
      }
    }

    /* set TZSPC TZBMPC_CTL configuration register */
    TZPCU_TZBMPC_CTL(tzbmpx) = reg_value;
}

/*!
    \brief      configure secure access state (API_ID(0x0009U))
    \param[in]  tzbmpx: TZBMPCx(x=0,1,2,3)
    \param[in]  sec_illaccess_state: secure illegal access state
                only one parameter can be selected which is shown as below:
      \arg        SECURE_ILLEGAL_ACCESS_ENABLE: secure read/write access non-secure SRAM is illegal
      \arg        SECURE_ILLEGAL_ACCESS_DISABLE: secure read/write access non-secure SRAM is legal
    \param[out] none
    \retval     none
*/
void tzpcu_tzbmpc_secure_access_config(uint32_t tzbmpx, uint32_t sec_illaccess_state)
{
    uint32_t reg_value;

    /* get TZSPC TZBMPC_CTL configuration register */
    reg_value = TZPCU_TZBMPC_CTL(tzbmpx);

    if(SECURE_ILLEGAL_ACCESS_ENABLE == sec_illaccess_state){
        reg_value &= ~TZPCU_TZBMPC_CTL_SRWACFG;
    }else{
      if(SECURE_ILLEGAL_ACCESS_DISABLE == sec_illaccess_state){
        reg_value |= TZPCU_TZBMPC_CTL_SRWACFG;
      }
    }

    /* set TZSPC TZBMPC_CTL configuration register */
    TZPCU_TZBMPC_CTL(tzbmpx) = reg_value;
}

/*!
    \brief      configure block secure access mode (API_ID(0x000AU))
    \param[in]  tzbmpx: TZBMPCx(x=0,1,2,3)
    \param[in]  block_pos_num: block position number
                for TZBMPC0 and TZBMPC1 block position number is 0-255;
                for TZBMPC2 block position number is 0-511 only for GD32W515;
                for TZBMPC2 block position number is 0-255 only for GD32F5HC;
                for TZBMPC3 block position number is 0-767 only for GD32W515;
                for TZBMPC3 block position number is 0-511 only for GD32F5HC;
    \param[in]  access_mode: block secure access mode
                only one parameter can be selected which is shown as below:
      \arg        BLOCK_SECURE_ACCESS_MODE_SEC: block secure access mode is secure
      \arg        BLOCK_SECURE_ACCESS_MODE_NSEC: block secure access mode is non-secure
    \param[out] none
    \retval     none
*/
void tzpcu_tzbmpc_block_secure_access_mode_config(uint32_t tzbmpx, uint32_t block_pos_num, uint32_t access_mode)
{
    uint32_t reg_value, integer, mod;

    integer = block_pos_num / 32U;
    mod = block_pos_num % 32U;
    /* get TZSPC TZBMPC_VEC configuration register */
    reg_value = TZPCU_TZBMPC_VEC(tzbmpx, integer);

