burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Source/gd32w51x_f5hc_tzpcu.c
    if(BLOCK_SECURE_ACCESS_MODE_SEC == access_mode){
        reg_value |= 1U << mod;
    }else{
      if(BLOCK_SECURE_ACCESS_MODE_NSEC == access_mode){
        reg_value &= ~(1U << mod );
      }
    }

    /* set TZSPC TZBMPC_VEC configuration register */
    TZPCU_TZBMPC_VEC(tzbmpx, integer) = reg_value;
}

/*!
    \brief      lock configure union block secure access mode (API_ID(0x000BU))
    \param[in]  tzbmpx: TZBMPCx(x=0,1,2,3)
    \param[in]  union_block_position_num: union block position number
                for TZBMPC0 and TZBMPC1 union block position number is 0-7;
                for TZBMPC2 union block position number is 0-15 (only for GD32W515);
                for TZBMPC2 union block position number is 0-7 (only for GD32F5HC);
                for TZBMPC3 union block position number is 0-23 (only for GD32W515);
                for TZBMPC3 union block position number is 0-15 (only for GD32F5HC);
    \param[out] none
    \retval     none
*/
void tzpcu_tzbmpc_union_block_lock(uint32_t tzbmpx, uint32_t union_block_position_num)
{
    uint32_t reg_value;

    /* get TZSPC TZBMPC_LOCK1 configuration register */
    reg_value = TZPCU_TZBMPC_LOCK0(tzbmpx);

    reg_value |= 1U << union_block_position_num;

    /* set TZSPC TZBMPC_LOCK1 configuration register */
    TZPCU_TZBMPC_LOCK0(tzbmpx) = reg_value;
}

/*!
    \brief      enable illegal access interrupt (API_ID(0x000CU))
    \param[in]  periph: peripheral 
                only one parameter can be selected which is shown as below:
      \arg        TZPCU_PERIPH_TIMER1: TIMER1 peripheral
      \arg        TZPCU_PERIPH_TIMER2: TIMER2 peripheral
      \arg        TZPCU_PERIPH_TIMER3: TIMER3 peripheral
      \arg        TZPCU_PERIPH_TIMER4: TIMER4 peripheral
      \arg        TZPCU_PERIPH_TIMER5: TIMER5 peripheral
      \arg        TZPCU_PERIPH_WWDGT: WWDGT peripheral
      \arg        TZPCU_PERIPH_FWDGT: FWDGT peripheral
      \arg        TZPCU_PERIPH_SPI1: SPI1 peripheral
      \arg        TZPCU_PERIPH_USART1: USART1 peripheral
      \arg        TZPCU_PERIPH_USART2: USART2 peripheral
      \arg        TZPCU_PERIPH_I2C0: I2C0 peripheral
      \arg        TZPCU_PERIPH_I2C1: I2C1 peripheral
      \arg        TZPCU_PERIPH_USBFS: USBFS peripheral
      \arg        TZPCU_PERIPH_TIMER0: TIMER0 peripheral
      \arg        TZPCU_PERIPH_SPI0: SPI0 peripheral
      \arg        TZPCU_PERIPH_CTC: CTC peripheral (only for GD32F5HC)
      \arg        TZPCU_PERIPH_USART0: USART0 peripheral
      \arg        TZPCU_PERIPH_TIMER15: TIMER15 peripheral
      \arg        TZPCU_PERIPH_TIMER16: TIMER16 peripheral
      \arg        TZPCU_PERIPH_HPDF: HPDF peripheral(not support on GD32W515TX series devices) (only for GD32W515)
      \arg        TZPCU_PERIPH_CRC: CRC peripheral
      \arg        TZPCU_PERIPH_TSI: TSI peripheral (only for GD32W515)
      \arg        TZPCU_PERIPH_ICACHE: ICACHE peripheral
      \arg        TZPCU_PERIPH_ADC: ADC peripheral
      \arg        TZPCU_PERIPH_CAU: CAU peripheral
      \arg        TZPCU_PERIPH_HAU: HAU peripheral
      \arg        TZPCU_PERIPH_TRNG: TRNG peripheral
      \arg        TZPCU_PERIPH_PKCAU: PKCAU peripheral
      \arg        TZPCU_PERIPH_SDIO: SDIO peripheral (only for GD32W515)
      \arg        TZPCU_PERIPH_RTC: RTC peripheral
      \arg        TZPCU_PERIPH_PMU: PMU peripheral
      \arg        TZPCU_PERIPH_SYSCFG: SYSCFG peripheral
      \arg        TZPCU_PERIPH_DMA0: DMA0 peripheral
      \arg        TZPCU_PERIPH_DMA1: DMA1 peripheral
      \arg        TZPCU_PERIPH_RCU: RCU peripheral
      \arg        TZPCU_PERIPH_FLASH: FLASH peripheral
      \arg        TZPCU_PERIPH_FMC: FLASH REG peripheral
      \arg        TZPCU_PERIPH_EXTI: EXTI peripheral
      \arg        TZPCU_PERIPH_TZSPC: TZSPC peripheral
      \arg        TZPCU_PERIPH_TZIAC: TZIAC peripheral
      \arg        TZPCU_PERIPH_SRAM0: SRAM0 peripheral
      \arg        TZPCU_PERIPH_TZBMPC0_REG: ZBMPC0 register
      \arg        TZPCU_PERIPH_SRAM1: SRAM1 peripheral
      \arg        TZPCU_PERIPH_TZBMPC1_REG: TZBMPC1 register
      \arg        TZPCU_PERIPH_SRAM2: SRAM2 peripheral
      \arg        TZPCU_PERIPH_TZBMPC2_REG: TZBMPC2 register
      \arg        TZPCU_PERIPH_SRAM3: SRAM3 peripheral
      \arg        TZPCU_PERIPH_TZBMPC3_REG: TZBMPC3 register
      \arg        TZPCU_PERIPH_EFUSE: EFUSE peripheral
      \arg        TZPCU_PERIPH_SQPI_PSRAM: SQPI_PSRAM peripheral
      \arg        TZPCU_PERIPH_QSPI_FLASH: QSPI_FLASH peripheral
      \arg        TZPCU_PERIPH_SQPI_PSRAMREG: SQPI PSRAMREG peripheral
      \arg        TZPCU_PERIPH_QSPI_FLASHREG: QSPI FLASHREG peripheral
      \arg        TZPCU_PERIPH_WIFI_RF: WIFI RF peripheral (only for GD32W515)
      \arg        TZPCU_PERIPH_I2S1_ADD: I2S1_ADD peripheral
      \arg        TZPCU_PERIPH_DCI: DCI peripheral(not support on GD32W515TX series devices) (only for GD32W515)
      \arg        TZPCU_PERIPH_WIFI: WIFI peripheral (only for GD32W515)
      \arg        TZPCU_PERIPH_ALL: all peripherals
    \param[out] none
    \retval     none
*/
void tzpcu_tziac_interrupt_enable(uint32_t periph)
{
    uint32_t position = 0U, reg_value = 0U;

     if(TZPCU_PERIPH_ALL == (periph & TZPCU_PERIPH_ALL)){
        /* enable all interrupt */
        TZPCU_TZIAC_INTEN0 |= TZIAC_INTEN0_ALL;
        TZPCU_TZIAC_INTEN1 |= TZIAC_INTEN1_ALL;
        TZPCU_TZIAC_INTEN2 |= TZIAC_INTEN2_ALL;
    }else{
        /* get TZIAC_INTEN register value */
        reg_value = REG32(TZIAC + ((periph >> PERIPH_REGNUM_POS ) << 2U));

        position = periph & LSB_16BIT_MASK;
        if(periph & PERIPH_LOCATION_MASK){
            position = position << PERIPH_OFFSET;
        }

        reg_value |= position;

        /* set TZIAC_INTEN register value */
        REG32(TZIAC + ((periph >> PERIPH_REGNUM_POS ) << 2U)) = reg_value;
    }
}

/*!
    \brief      disable illegal access interrupt (API_ID(0x000DU))
    \param[in]  periph: peripheral 
                only one parameter can be selected which is shown as below:
      \arg        TZPCU_PERIPH_TIMER1: TIMER1 peripheral
      \arg        TZPCU_PERIPH_TIMER2: TIMER2 peripheral
      \arg        TZPCU_PERIPH_TIMER3: TIMER3 peripheral
      \arg        TZPCU_PERIPH_TIMER4: TIMER4 peripheral
      \arg        TZPCU_PERIPH_TIMER5: TIMER5 peripheral
      \arg        TZPCU_PERIPH_WWDGT: WWDGT peripheral
      \arg        TZPCU_PERIPH_FWDGT: FWDGT peripheral
      \arg        TZPCU_PERIPH_SPI1: SPI1 peripheral
      \arg        TZPCU_PERIPH_USART1: USART1 peripheral
      \arg        TZPCU_PERIPH_USART2: USART2 peripheral
      \arg        TZPCU_PERIPH_I2C0: I2C0 peripheral
      \arg        TZPCU_PERIPH_I2C1: I2C1 peripheral
      \arg        TZPCU_PERIPH_USBFS: USBFS peripheral
      \arg        TZPCU_PERIPH_TIMER0: TIMER0 peripheral
      \arg        TZPCU_PERIPH_SPI0: SPI0 peripheral
      \arg        TZPCU_PERIPH_CTC: CTC peripheral (only for GD32F5HC)
      \arg        TZPCU_PERIPH_USART0: USART0 peripheral
      \arg        TZPCU_PERIPH_TIMER15: TIMER15 peripheral
      \arg        TZPCU_PERIPH_TIMER16: TIMER16 peripheral
      \arg        TZPCU_PERIPH_HPDF: HPDF peripheral(not support on GD32W515TX series devices) (only for GD32W515)
      \arg        TZPCU_PERIPH_CRC: CRC peripheral
      \arg        TZPCU_PERIPH_TSI: TSI peripheral (only for GD32W515)
      \arg        TZPCU_PERIPH_ICACHE: ICACHE peripheral
      \arg        TZPCU_PERIPH_ADC: ADC peripheral
      \arg        TZPCU_PERIPH_CAU: CAU peripheral
      \arg        TZPCU_PERIPH_HAU: HAU peripheral
      \arg        TZPCU_PERIPH_TRNG: TRNG peripheral
      \arg        TZPCU_PERIPH_PKCAU: PKCAU peripheral
      \arg        TZPCU_PERIPH_SDIO: SDIO peripheral (only for GD32W515)
      \arg        TZPCU_PERIPH_RTC: RTC peripheral
      \arg        TZPCU_PERIPH_PMU: PMU peripheral
      \arg        TZPCU_PERIPH_SYSCFG: SYSCFG peripheral
      \arg        TZPCU_PERIPH_DMA0: DMA0 peripheral
      \arg        TZPCU_PERIPH_DMA1: DMA1 peripheral
      \arg        TZPCU_PERIPH_RCU: RCU peripheral
      \arg        TZPCU_PERIPH_FLASH: FLASH peripheral
      \arg        TZPCU_PERIPH_FMC: FLASH REG peripheral
      \arg        TZPCU_PERIPH_EXTI: EXTI peripheral
      \arg        TZPCU_PERIPH_TZSPC: TZSPC peripheral
      \arg        TZPCU_PERIPH_TZIAC: TZIAC peripheral
      \arg        TZPCU_PERIPH_SRAM0: SRAM0 peripheral
      \arg        TZPCU_PERIPH_TZBMPC0_REG: ZBMPC0 REG peripheral
      \arg        TZPCU_PERIPH_SRAM1: SRAM1 peripheral
      \arg        TZPCU_PERIPH_TZBMPC1_REG: TZBMPC1 REG peripheral
      \arg        TZPCU_PERIPH_SRAM2: SRAM2 peripheral
      \arg        TZPCU_PERIPH_TZBMPC2_REG: TZBMPC2 REG peripheral
      \arg        TZPCU_PERIPH_SRAM3: SRAM3 peripheral
      \arg        TZPCU_PERIPH_TZBMPC3_REG: TZBMPC3 REG peripheral
      \arg        TZPCU_PERIPH_EFUSE: EFUSE peripheral
      \arg        TZPCU_PERIPH_SQPI_PSRAM: SQPI_PSRAM peripheral
      \arg        TZPCU_PERIPH_QSPI_FLASH: QSPI_FLASH peripheral
      \arg        TZPCU_PERIPH_SQPI_PSRAMREG: SQPI PSRAMREG peripheral
      \arg        TZPCU_PERIPH_QSPI_FLASHREG: QSPI FLASHREG peripheral
      \arg        TZPCU_PERIPH_WIFI_RF: WIFI RF peripheral (only for GD32W515)
      \arg        TZPCU_PERIPH_I2S1_ADD: I2S1_ADD peripheral
      \arg        TZPCU_PERIPH_DCI: DCI peripheral(not support on GD32W515TX series devices) (only for GD32W515)
      \arg        TZPCU_PERIPH_WIFI: WIFI peripheral (only for GD32W515)
      \arg        TZPCU_PERIPH_ALL: all peripherals
    \param[out] none
    \retval     none
*/
void tzpcu_tziac_interrupt_disable(uint32_t periph)
{
    uint32_t position = 0U, reg_value = 0U;

     if(0U != (periph & TZPCU_PERIPH_ALL)){
        /* disable all interrupt */
        TZPCU_TZIAC_INTEN0 &= ~TZIAC_INTEN0_ALL;
        TZPCU_TZIAC_INTEN1 &= ~TZIAC_INTEN1_ALL;
        TZPCU_TZIAC_INTEN2 &= ~TZIAC_INTEN2_ALL;
    }else{
        /* get TZIAC_INTEN register value */
        reg_value = REG32(TZIAC + ((periph >> PERIPH_REGNUM_POS ) << 2U));

        position = periph & LSB_16BIT_MASK;
        if(periph & PERIPH_LOCATION_MASK){
            position = position << PERIPH_OFFSET;
        }

